IDEA Open Model
Point2D Class
Compatible with IDEA StatiCa 20.1
 Represents an x- and y-coordinate pair in two-dimensional space.
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.Geometry2D.Point2D
 Namespace: IdeaRS.OpenModel.Geometry2D
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public class Point2D : OpenObject
Public Class Point2D
	Inherits OpenObject
The Point2D type exposes the following members.
Constructors
Name | Description
Point2D
Initializes a new instance of the Point2D class
Top
Properties
Name | Description
X
 Gets or sets the X-coordinate value
Y
 Gets or sets the Y-coordinate value
Top
See Also
Reference
IdeaRS.OpenModel.Geometry2D Namespace